CS-2365/notes/html_output/4 - Java Programming Part 1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-31 Fri 13:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kiera" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1f7e2df">1. Basics</a>
<ul>
<li><a href="#org94a0ace">1.1. Java is a strongly typed language</a></li>
<li><a href="#orge737dd7">1.2. `String` class</a></li>
<li><a href="#org867c87d">1.3. Primitive vs. Reference Vars</a></li>
<li><a href="#org01b85a3">1.4. The `Scanner` class</a></li>
</ul>
</li>
<li><a href="#org2a77d8a">2. Classes</a></li>
<li><a href="#org7728d97">3. Object</a>
<ul>
<li><a href="#org204ef3f">3.1. Constructor</a></li>
<li><a href="#org4417115">3.2. UML Diagram</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1f7e2df" class="outline-2">
<h2 id="org1f7e2df"><span class="section-number-2">1.</span> Basics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org94a0ace" class="outline-3">
<h3 id="org94a0ace"><span class="section-number-3">1.1.</span> Java is a strongly typed language</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>In java, every variable, expression, or object in java has a defined type, and the language ensures that the operations on these types are safe and consistent.</li>
<li>It enforces strict type checking during both compile-time and runtime.</li>
<li>Java allows type conversions, bust they must be explicit in certain cases, ensuring that the programmer is aware of potential data loss or changes in value.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">b</span> = <span style="color: #b4916d; font-weight: bold;">100.45</span>;
<span style="color: #DFDFDF; font-weight: bold;">int</span> <span style="color: #bbc2cf;">a</span> = b; <span style="color: #98be65;">//</span><span style="color: #98be65;">will show an error</span>
<span style="color: #DFDFDF; font-weight: bold;">int</span> <span style="color: #bbc2cf;">a</span> = <span style="color: #0170bf;">(</span><span style="color: #DFDFDF; font-weight: bold;">int</span><span style="color: #0170bf;">)</span> b; <span style="color: #98be65;">//</span><span style="color: #98be65;">this will not show an error</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge737dd7" class="outline-3">
<h3 id="orge737dd7"><span class="section-number-3">1.2.</span> `String` class</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In java, there is no primitive data type that holds a series of characters.
</p>
<ul class="org-ul">
<li>`String` class from the Java standard library is used for this purpose.</li>
<li>In order to be useful, the variable must be created to reference a `String` object.
`String number;`</li>
<li>Notice the `S` in `String` is upper case.</li>
</ul>
</div>
</div>
<div id="outline-container-org867c87d" class="outline-3">
<h3 id="org867c87d"><span class="section-number-3">1.3.</span> Primitive vs. Reference Vars</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Primitive variables actually contain the value that they have been assigned.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">int</span> <span style="color: #bbc2cf;">number</span> = <span style="color: #b4916d; font-weight: bold;">25</span>;
</pre>
</div>

<ul class="org-ul">
<li>The value 25 will be stored in the memory location associated with the variable Number.</li>
<li>Objects are not stored in variables, however. Instead, they are <b>referenced</b> by variables.</li>
<li>When a variable references and object, it contains the memory address of the object&rsquo;s location.</li>
<li>Then it is said that the variable references the object.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">String</span> <span style="color: #bbc2cf;">cityName</span> = <span style="color: #b4916d;">"Charleston"</span>;
</pre>
</div>

<p>
`cityName` Address to the object \(\to\) `Charleston` The object that contains the character string &ldquo;Charleston&rdquo;
</p>
</div>
</div>
<div id="outline-container-org01b85a3" class="outline-3">
<h3 id="org01b85a3"><span class="section-number-3">1.4.</span> The `Scanner` class</h3>
<div class="outline-text-3" id="text-1-4">
<p>
`Scanner` class
</p>
<ul class="org-ul">
<li>To read input from keyboard</li>
<li>Defined in `java.util`</li>
<li>Use the following statement at the top of the programs: `impott java.util.Scanner;`</li>
<li>Scanner objects work in `System.in`</li>
</ul>

<p>
To create a `Scanner` object:
</p>
<ul class="org-ul">
<li>`Scanner keyboard = new Scanner (System.in);`</li>
</ul>

<p>
The purpose of `Scanner.nextLine();` is to take the next possible input and store it as a variable.
There also exists different inputs for different datatypes.
</p>
<ul class="org-ul">
<li>`Scanner.nextLine();`</li>
<li>`Scanner.nextInt();`</li>
<li>`Scanner.nextDouble();`</li>
<li>&#x2026;</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">Scanner</span> <span style="color: #bbc2cf;">keyboard</span> = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Scanner</span> <span style="color: #0170bf;">(</span>System.in<span style="color: #0170bf;">)</span>; <span style="color: #98be65;">//</span><span style="color: #98be65;">create the new object</span>
System.out.println<span style="color: #0170bf;">(</span><span style="color: #b4916d;">"What is your name?"</span><span style="color: #0170bf;">)</span>;
name = keyboard.nextLine<span style="color: #0170bf;">()</span>; <span style="color: #98be65;">//</span><span style="color: #98be65;">take the input from the user</span>
System.out.println<span style="color: #0170bf;">(</span><span style="color: #b4916d;">"Your name is "</span> + name<span style="color: #0170bf;">)</span>; <span style="color: #98be65;">//</span><span style="color: #98be65;">print the input</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2a77d8a" class="outline-2">
<h2 id="org2a77d8a"><span class="section-number-2">2.</span> Classes</h2>
<div class="outline-text-2" id="text-2">
<p>
A class is a template which is used to define a new type of data.
</p>
<ul class="org-ul">
<li>Variables (data) and methods defined within a class.</li>
<li>Members of class</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">class</span> <span style="color: #DFDFDF; font-weight: bold;">classname</span> <span style="color: #0170bf;">{</span>
    type instance-variable1;
    <span style="color: #98be65;">//</span><span style="color: #98be65;">...</span>
    type instance-variableN;
    <span style="color: #DFDFDF; font-weight: bold;">type</span> <span style="color: #DFDFDF; font-weight: bold;">methodname1</span><span style="color: #c678dd;">(</span>parameter-list<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #98be65;">//</span><span style="color: #98be65;">body of the method</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #0170bf;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7728d97" class="outline-2">
<h2 id="org7728d97"><span class="section-number-2">3.</span> Object</h2>
<div class="outline-text-2" id="text-3">
<p>
Objects of classes
</p>
<ul class="org-ul">
<li>An object is an instance of a class</li>
<li>Two-step process obtaining object of a class.
<ul class="org-ul">
<li>Declare a variable of the class type, acquire and actual physical copy of the object using `new` operator.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">Box</span> <span style="color: #bbc2cf;">mybox</span>;
MyBox = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">mybox</span>;
</pre>
</div>


<p>
To taccess both the variables and methods within an object
</p>
<ul class="org-ul">
<li>Dot(.) operator called as a seperator</li>
<li>objectName.variable</li>
<li>objectName.method()</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">Box</span> <span style="color: #bbc2cf;">mybox</span>; <span style="color: #98be65;">//</span><span style="color: #98be65;">creates empty box</span>
<span style="color: #98be65;">//</span><span style="color: #98be65;">vs</span>
mybox = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Box</span><span style="color: #0170bf;">()</span> <span style="color: #98be65;">//</span><span style="color: #98be65;">creates "box" with the "box" object (including components)</span>

<span style="color: #98be65;">//</span><span style="color: #98be65;">components</span>
mybox.width<span style="color: #0170bf;">()</span>
mybox.height<span style="color: #0170bf;">()</span>
mybox.length<span style="color: #0170bf;">()</span>
</pre>
</div>

<p>
<b>new</b> operator.
</p>
<ul class="org-ul">
<li>Dynamically allocates memory for an object during run time.</li>
</ul>

<p>
To create a class, you do not need a &ldquo;void main&rdquo; method.
Here is an example:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">public</span> <span style="color: #DFDFDF; font-weight: bold;">class</span> <span style="color: #DFDFDF; font-weight: bold;">Box</span><span style="color: #0170bf;">{</span> <span style="color: #98be65;">//</span><span style="color: #98be65;">without public static void.</span>
    <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">width</span>;
    <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">depth</span>;
    <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">height</span>;

    <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #DFDFDF; font-weight: bold;">volume</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        <span style="color: #DFDFDF; font-weight: bold;">return</span> width * depth * height;
    <span style="color: #c678dd;">}</span>
<span style="color: #0170bf;">}</span>

<span style="color: #DFDFDF; font-weight: bold;">public</span> <span style="color: #DFDFDF; font-weight: bold;">static</span> <span style="color: #DFDFDF; font-weight: bold;">void</span> <span style="color: #DFDFDF; font-weight: bold;">main</span><span style="color: #0170bf;">()</span> <span style="color: #0170bf;">{</span> <span style="color: #98be65;">//</span><span style="color: #98be65;">public static void</span>
    <span style="color: #DFDFDF; font-weight: bold;">Box</span> <span style="color: #bbc2cf;">b1</span>;
    b1 = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Box</span><span style="color: #c678dd;">()</span>;

    <span style="color: #DFDFDF; font-weight: bold;">Box</span> <span style="color: #bbc2cf;">b2</span>;
    b2 = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Box</span><span style="color: #c678dd;">()</span>;

    b1.depth = <span style="color: #b4916d; font-weight: bold;">23</span>;
    b1.height = <span style="color: #b4916d; font-weight: bold;">3</span>;
    b1.width = <span style="color: #b4916d; font-weight: bold;">2</span>;

    System.out.println<span style="color: #c678dd;">(</span><span style="color: #b4916d;">"Volume of Box b1 is "</span> + b1.volume<span style="color: #c678dd;">)</span>;

    <span style="color: #DFDFDF; font-weight: bold;">Box</span> <span style="color: #bbc2cf;">b3</span>,<span style="color: #bbc2cf;">b4</span>;
    b3 = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Box</span><span style="color: #c678dd;">()</span>;
    b4 = b2; <span style="color: #98be65;">// </span><span style="color: #98be65;">due to this</span>

    <span style="color: #98be65;">// </span><span style="color: #98be65;">the `new` operator has not been called. therefore, it's simply a copy (as if it was a variable.)</span>
    <span style="color: #98be65;">// </span><span style="color: #98be65;">it's simply just a pointer. a symbolic link. something silly like that.</span>

    b2.depth = <span style="color: #b4916d; font-weight: bold;">2</span>;
    b2.height = <span style="color: #b4916d; font-weight: bold;">3</span>;
    b2.width = <span style="color: #b4916d; font-weight: bold;">4</span>;

    <span style="color: #98be65;">// </span><span style="color: #98be65;">b2 and b4 remain the same</span>
    System.out.println<span style="color: #c678dd;">(</span>b2.volume<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span>;
    System.out.println<span style="color: #c678dd;">(</span>b4.volume<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span>;

    b4.depth = <span style="color: #b4916d; font-weight: bold;">2</span>;
    b4.height = <span style="color: #b4916d; font-weight: bold;">1</span>;
    b4.width = <span style="color: #b4916d; font-weight: bold;">4</span>;

    <span style="color: #98be65;">// </span><span style="color: #98be65;">b2 and b4 remain the same</span>
    System.out.println<span style="color: #c678dd;">(</span>b2.volume<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span>;
    System.out.println<span style="color: #c678dd;">(</span>b2.volume<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span>;
<span style="color: #0170bf;">}</span>
</pre>
</div>
</div>
<div id="outline-container-org204ef3f" class="outline-3">
<h3 id="org204ef3f"><span class="section-number-3">3.1.</span> Constructor</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Primitive types do not need a `new` operator. (int, float, char, boolean)
</p>
<ul class="org-ul">
<li>implemented as &ldquo;normal&rdquo; variable</li>
<li>do not need to use `new` operator.</li>
</ul>

<p>
However, wrapper classes for primitive types:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">String</span> <span style="color: #bbc2cf;">str</span> = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">String</span><span style="color: #0170bf;">(</span><span style="color: #b4916d;">"Lubbock"</span><span style="color: #0170bf;">)</span>;
<span style="color: #DFDFDF; font-weight: bold;">String</span> <span style="color: #bbc2cf;">str1</span> = <span style="color: #b4916d;">"Lubbock"</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4417115" class="outline-3">
<h3 id="org4417115"><span class="section-number-3">3.2.</span> UML Diagram</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Standard for Unified Modeling Language
</p>

<p>
Provides a set of standard diagrams for graphically depicting object-oriented systems.
</p>

<p>
The constructors go in the `methods` area.
<b>They do not have return type.</b>
</p>

<p>
<span class="underline">| class name |</span>
<span class="underline">| fields     |</span>   format: (+ or - depending on public or private)(name): (return type)
<span class="underline">| methods    |</span>   format: (+ or - depending on public or private)(name)((var type):(data type)): (return type)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kiera</p>
<p class="date">Created: 2025-01-31 Fri 13:49</p>
</div>
</body>
</html>
